const dialogueMap = {
    '1': {
        0: 1,       //回去
        1: 11,      //激動
        11: 13,     //掛斷
        12: 13,     //掛斷
        13: 131,    //含糊帶過 >BE.
        14: 141,    //含糊帶過
        141: 151,   //含糊帶過
        142: 151,   //含糊帶過 >BE.
        152: 1521,  //逗一下 >HE
        2: 21,      //接通
        21: 211,    //含糊帶過 >BE.
        22: 221     //逗一下>HE
    },
    '3': {
        1: 12,      //反駁
        11: 14,     //接起來
        12: 14,     //接起來
        13: 132,    //老實交代 >HE
        14: 142,    //承認
        141: 152,   //老實交代
        142: 152,   //老實交代
        152: 1522,  //認真的再問一次 >HE
        2: 22,      //掛斷
        21: 212,    //老實交代 >OE
        22: 222     //認真的再問一次 >HE
    },
    '2': {
        0: 2        //不回去
    }
};